farmertan81/Spot-Welder/STM32G474CE/src/main.c
#define V_CAP_DIVIDER 6.0f

/* ============ INA226 Addresses ============ */
#define INA226_ADDR_PACK 0x40
#define INA226_ADDR_NODE1 0x41
#define INA226_ADDR_NODE2 0x44

/* ============ INA226 Registers ============ */
#define INA226_REG_CONFIG 0x00
#define INA226_REG_SHUNT_V 0x01
#define INA226_REG_BUS_V 0x02
#define INA226_REG_CALIBRATION 0x05

/* ============ INA226 Shunt Resistor ============ */
#define INA226_SHUNT_R 0.0002f /* 200 µΩ */
/* Rev1 charge current correction factor (matches ESP32 value) */
#define CHARGE_CURRENT_CORRECTION 1.0f

/* ============ Charger Thresholds (INA226 ONLY) ============ */
#define CHG_VPACK_ON 8.7f   /* Turn charger ON below this */
#define CHG_VPACK_OFF 9.11f /* Turn charger OFF at/above this */

/* ============ INA226 Scaling ============ */
// Calibrated 2025-05-08 using Fluke 87V multimeter
// Actual: vlow=2.904V, vmid=5.805V, vpack=8.71V
#define V_NODE1_SCALE 1.001327f  // Was: 0.9965f
#define V_NODE2_SCALE 0.986048f  // Was: 0.9835f
#define VPACK_SCALE   1.001149f  // Calibrated 2025-05-08: 8.71V (Fluke 87V)

/* ============ Limits / Timing ============ */
static const uint32_t WELD_COOLDOWN_MS = 500;
static const uint16_t MAX_WELD_MS = 200;
static const uint32_t PEDAL_DEBOUNCE_MS = 40;
static const uint32_t BOOT_INHIBIT_MS = 5000;
static const uint32_t ARM_TIMEOUT_MS = 0;
static const uint32_t READY_TIMEOUT_MS = 1500;
static const float CONTACT_THRESHOLD_V_DEFAULT = 1.5f;
static const uint32_t CONTACT_SAMPLE_MS = 10;
static const uint32_t CONTACT_DEBOUNCE_MS = 50;

/* Phase-start alignment thresholds.
 * Use waveform current itself (not command time) to mark phase start at the
 * first meaningful conduction sample. */
static const float PHASE_START_MIN_CURRENT_A = 50.0f;
static const float PHASE_START_PEAK_RATIO = 0.10f;

/* UART TX pacing for long WAVEFORM lines.
 * 1024 bytes @2Mbps is ~4ms on wire, so 250ms timeout is generous. */
static const uint32_t UART_TX_CHUNK_SIZE = 1024U;
static const uint32_t UART_TX_TIMEOUT_MS = 250U;

/* ============ PWM Settings ============ */
static const uint16_t PWM_MAX = 1023;
static const uint16_t TIM1_PSC = 0;
static const uint32_t TIM1_ARR = 16999;

#if (SystemCoreClock != 170000000)
#warning "TIM2 PSC assumes 170MHz clock. Verify timing!"
#endif

/* ============ HAL handles ============ */
UART_HandleTypeDef huart1;
TIM_HandleTypeDef htim1;
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
I2C_HandleTypeDef hi2c1;
IWDG_HandleTypeDef hiwdg;

/* ==== VDDA Calibration ==== */
/* STM32G474: Factory VREFINT cal was measured at VDDA = 3.0V (3000 mV).
 * The HAL/LL headers may define VREFINT_CAL_VREF (in mV) and VREFINT_CAL_ADDR.
 * We use our own names to avoid redefinition warnings/errors. */
#define VREFINT_CAL_MV 3000UL /* Calibration VDDA in millivolts */
#define VREFINT_CAL_PTR \
    ((volatile uint16_t*)0x1FFF75AAUL) /* Factory cal value address    */
static float measured_vdda = 3.3f; /* Updated periodically by measureVDDA() */

/* ============================================================
 * REMOTE FIRMWARE UPDATE: jump to the STM32G4 ROM (system-memory) bootloader
 * ------------------------------------------------------------
 * The "BOOTLOADER" UART command makes this MCU re-enter the factory ROM
 * bootloader (AN3155 UART protocol) so the ESP32 can flash a new image WITHOUT
 * the BOOT0/RESET hardware lines.
 *
 * Why a reset + flag instead of an immediate in-place jump:
 *   This firmware arms the Independent Watchdog (IWDG, ~800 ms, software mode -
 *   see MX_IWDG_Init).  Once started the IWDG CANNOT be stopped by software, and
 *   the ROM bootloader never refreshes it.  A direct in-place jump would
 *   therefore be killed by an IWDG reset ~800 ms later - far too short to flash
 *   a multi-second image - and that reset would drop straight back into the
 *   user app (BOOT0 low), aborting the update.
 *   The robust software-only method is:
 *     1) "BOOTLOADER" cmd -> stash a magic value in a backup register (survives
 *        a warm reset) and call NVIC_SystemReset().
 *     2) A system reset STOPS the IWDG (software mode) and clears it.
 *     3) Very early in main() - BEFORE MX_IWDG_Init() re-arms the watchdog - we
 *        detect the magic value and call jumpToBootloader().  The ROM bootloader
 *        then runs with NO active watchdog and can flash for as long as needed.
 *   jumpToBootloader() itself performs the proper ARM Cortex-M4 entry sequence
 *   (mask IRQs, stop SysTick, deinit clocks/peripherals, set VTOR + MSP, jump).
 * ============================================================ */
#define SYSTEM_BOOTLOADER_ADDR 0x1FFF0000UL /* STM32G4 system memory base */
#define BOOTLOADER_REQUEST_MAGIC 0xB00710ADUL /* "BOOT LOAD" sentinel value  */
/* TAMP backup register used as the warm-reset request flag. Backup registers
 * keep their contents across a system reset (only a power-on / backup-domain
 * reset clears them), which is exactly what we need to pass the request through
 * NVIC_SystemReset(). BKP0R is otherwise unused by this firmware. */
#define BOOTLOADER_FLAG_REG (TAMP->BKP0R)

/* PRIMARY warm-reset request flag: a plain-SRAM marker placed in the .noinit
 * linker section (see STM32G474CETX_FLASH.ld). Unlike the TAMP backup register,
 * SRAM contents SURVIVE a system reset (NVIC_SystemReset) and are only cleared
 * by a true power-on reset - so the request reliably passes through the warm
 * reset on this WeAct board where VBAT/backup-domain is not wired. The startup
 * code does NOT zero this section, so we must initialise it ourselves only on a
 * cold boot (handled implicitly: a random power-on value is extremely unlikely
 * to equal the magic, and we always clear it right after detection). */
__attribute__((section(".noinit"))) volatile uint32_t g_bootloader_marker;

/* Bootloader-path BREADCRUMB. Also lives in .noinit, so it survives ALL resets
 * except a true power-on (POR/BOR) - including the warm NVIC_SystemReset we do to
 * enter the bootloader AND the external NRST pin pulse the ESP applies on the
 * hardware fallback. We stamp it at each step of the software ROM-entry path, so
 * on the NEXT boot we can print exactly how far the jump got:
 *   1 = BOOTLOADER cmd received, marker set, about to NVIC_SystemReset()
 *   2 = after reset, early-main detected the marker, about to jumpToBootloader()
 *   3 = inside jumpToBootloader(), about to branch into the ROM at 0x1FFF0000
 * If the post-flash boot shows stage 3 we reached the ROM jump; stage 2 means the
 * jump faulted before branching; stage 1 means the marker was lost across reset.
 * The value is tagged with a magic so random power-on garbage isn't mistaken for
 * a real breadcrumb. */
#define BLSTAGE_MAGIC 0x57130000UL
#define BLSTAGE(n)    (BLSTAGE_MAGIC | (uint32_t)(n))
__attribute__((section(".noinit"))) volatile uint32_t g_bl_stage;

/* ============ Weld Params (defaults) ============ */
static volatile uint8_t weld_mode = 1;
static volatile uint16_t weld_d1_ms = 10;
static volatile uint16_t weld_gap1_ms = 0;
static volatile uint16_t weld_d2_ms = 0;
static volatile uint16_t weld_gap2_ms = 0;
static volatile uint16_t weld_d3_ms = 0;

