farmertan81/Spot-Welder/STM32G474CE/src/main.c
static volatile uint8_t weld_power_pct = 100;
static volatile bool preheat_enabled = false;
static volatile uint16_t preheat_ms = 20;
static volatile uint8_t preheat_pct = 30;
static volatile uint16_t preheat_gap_ms = 3;

/* ============ Control mode (persisted from Flash) ============ */
uint8_t control_mode = 0; /* 0=time, 1=joule */

/* Joule settings (persisted from Flash) */
float joule_target_j = 50.0f;
uint32_t joule_max_ms = 40;
float joule_min_current_a = 0.5f;

/* Runtime Joule tracking
 * joule_accumulated is workpiece energy (lead-compensated) used for control. */
float joule_accumulated = 0.0f;           /* Workpiece Joules */
float joule_total_accumulated = 0.0f;     /* Total Joules from caps (V*I*dt) */
float joule_lead_loss_accumulated = 0.0f; /* Estimated lead losses (I^2*R*dt) */
bool joule_target_reached = false;
bool joule_timeout_abort = false;
bool joule_bad_contact_abort = false;
uint32_t joule_actual_duration_us = 0;

/* ============ Trigger Settings ============ */
static volatile uint8_t trigger_mode = 1;        // 1 = pedal, 2 = contact
static volatile uint8_t contact_hold_steps = 2;  // each step = 500 ms
static volatile uint8_t contact_with_pedal =
    1;  // 1 = require contact in pedal mode (safe default)

/* ============ State ============ */
static volatile bool welding_now = false;
static uint32_t last_weld_ms = 0;

static bool armed = false;
static uint32_t armed_until_ms = 0;
static uint32_t boot_ms = 0;

static bool system_ready = false;
static uint32_t ready_until_ms = 0;

static GPIO_PinState pedal_last_raw = GPIO_PIN_SET;
static GPIO_PinState pedal_stable = GPIO_PIN_SET;
static uint32_t pedal_last_change_ms = 0;

static float temp_filtered_c = 25.0f;
static float current_peak_amps = 0.0f;  // Track peak of recipe

/* Added calibration capture values */
static float cal_vcap_before = 0.0f;
static float cal_vcap_after = 0.0f;
static uint32_t cal_adc_peak_raw = 0;
static float cal_current_avg = 0.0f;

/* Configurable lead resistance (default 1.1 mΩ).
 * Measured: 0.54 mΩ + 0.57 mΩ = 1.1 mΩ total (4-wire Kelvin test).
 * 41% improvement over previous leads (1.87 mΩ → 1.1 mΩ). */
static float lead_resistance_ohms = 0.0011f;  // 1.1 mΩ measured
static PersistentSettings g_persistent_settings = {0};
static const float LEAD_RESISTANCE_MIN_OHMS = 0.0001f; /* 0.1 mΩ */
static const float LEAD_RESISTANCE_MAX_OHMS = 0.0100f; /* 10.0 mΩ */

/* ============ Waveform Capture (Phase 3) ============ */
#define WAVEFORM_BUFFER_SIZE 4096
#define WAVEFORM_CHUNK_SAMPLES 100U
#define WAVEFORM_LINE_BUFFER_SIZE (WAVEFORM_CHUNK_SAMPLES * 18 + 256)
#define WAVEFORM_SAMPLE_INTERVAL_US 100U
/*
 * Gap timing compensation: scope-measured overhead from preheat-FET-off
 * to gap-timer-start plus gap-timer-end to main-FET-on.  This fixed cost
 * comes from waveform bookkeeping, timestamp capture, and function call
 * overhead.  Empirically measured at ~90µs via oscilloscope.
 *
 * Adjust this value if you change compiler optimization level or modify
 * the fireRecipe() gap bookkeeping code.
 */
#define GAP_TIMING_COMPENSATION_US 150U
#define PWM_PERIOD_US 100U
#define WAVEFORM_PWM_PHASE_SWEEP_STEP_US 12U
#define WAVEFORM_PWM_PHASE_SWEEP_SAMPLES 6U
#define WAVEFORM_PRE_SAMPLES 10U  /* 1ms pre-buffer */
#define WAVEFORM_POST_SAMPLES 10U /* 1ms post-buffer */
#define WAVEFORM_MAX_PULSE_MS 100U
#define WAVEFORM_MAX_ACTIVE_SAMPLES \
    ((WAVEFORM_MAX_PULSE_MS * 1000U) / WAVEFORM_SAMPLE_INTERVAL_US)

/* Temporary ADC debug switch:
 * 1 = re-apply ADC channel config inside adcReadFastCurrentPair() for A/B
 * check. 0 = rely only on pre-config from adcPrepareFastCurrentChannels(). */
#define ADC_DEBUG_USE_OLD_CONFIG 0
#define ADC_PAIR_VERBOSE_DEBUG 0  // Set to 1 only for debugging ADC reads

#define ADC_FAST_CURRENT_P_CHANNEL ADC_CHANNEL_2
#define ADC_FAST_CURRENT_N_CHANNEL ADC_CHANNEL_3

/* Capture capacity supports up to 1ms pre + 100ms pulse + 1ms post = 1020
 * samples. Keep a larger ring (4096) for debug headroom and future longer
 * windows. */
_Static_assert(WAVEFORM_BUFFER_SIZE >=
                   (WAVEFORM_PRE_SAMPLES + WAVEFORM_MAX_ACTIVE_SAMPLES +
                    WAVEFORM_POST_SAMPLES),
               "WAVEFORM_BUFFER_SIZE too small for 100ms capture window");

/* Safety check: each sample adds ~14 chars (",AAAA.AA,VV.VV") to WAVEFORM line.
 */
_Static_assert(
    WAVEFORM_BUFFER_SIZE <= 4096,
    "Unexpected waveform buffer growth; re-check RAM/UART line budget");
_Static_assert(WAVEFORM_LINE_BUFFER_SIZE >= (WAVEFORM_CHUNK_SAMPLES * 18 + 256),
               "WAVEFORM_LINE_BUFFER_SIZE too small for waveform CSV payload");

typedef struct {
    float current_amps;
    float voltage_volts;
    uint32_t timestamp_us;
} WaveformSample;

static WaveformSample waveform_buffer[WAVEFORM_BUFFER_SIZE];
static volatile uint16_t waveform_index = 0;
static volatile bool waveform_capture_active = false;
static uint32_t waveform_capture_start_us = 0;
static uint32_t waveform_last_sample_us = 0;
static uint16_t waveform_pulse_start_index = 0;
static uint16_t waveform_pulse_end_index = 0;

/* Phase markers for host/UI visualization.
 * All indices are sample indices with end indices EXCLUSIVE.
 * WAVEFORM_START emits: total, pre_start, pre_end, gap_start, gap_end,
 * main_start, main_end. */
static uint16_t waveform_preheat_start_index = 0;
static uint16_t waveform_preheat_end_index = 0;
static uint16_t waveform_gap_start_index = 0;
static uint16_t waveform_gap_end_index = 0;
static uint16_t waveform_main_start_index = 0;
static uint16_t waveform_main_end_index = 0;

/* Exact firmware phase boundary timestamps (absolute micros_now() domain). */
static uint32_t wf_preheat_start_us = 0;
static uint32_t wf_preheat_end_us = 0;
static uint32_t wf_gap_start_us = 0;
static uint32_t wf_gap_end_us = 0;
static uint32_t wf_main_start_us = 0;
static uint32_t wf_main_end_us = 0;

/* Cached once before each pulse to avoid slow 16x averaged voltage reads during
 * 200us sampling. */
static float cached_vcap = 0.0f;

