farmertan81/Spot-Welder/STM32G474CE/src/main.c
    adc1_fast_current_mode = false;
    adc1_fast_rank1_channel = 0U;
    adc1_fast_rank2_channel = 0U;

    /* Configure for scan mode with 3 channels */
    hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
    hadc1.Init.ContinuousConvMode = DISABLE;
    hadc1.Init.DiscontinuousConvMode =
        DISABLE; /* NOT needed for register read */
    hadc1.Init.NbrOfConversion = 3;
    hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;

    if (HAL_ADC_Init(&hadc1) != HAL_OK) {
        uartSend("DENY,ADC_INIT_FAIL");
        return;
    }

    /* Configure Channel 2 (P) - Rank 1 */
    sConfig.Channel = ADC_CHANNEL_2;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;

    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        uartSend("DENY,CH2_CFG_FAIL");
        return;
    }
    adc1_fast_rank1_channel = adcChannelEnumToNumber(sConfig.Channel);

#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_CH_SET,rank=1,channel=2\r\n");
#endif

    /* Configure Channel 3 (N) - Rank 2 */
    sConfig.Channel = ADC_CHANNEL_3;
    sConfig.Rank = ADC_REGULAR_RANK_2;
    sConfig.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;

    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        uartSend("DENY,CH3_CFG_FAIL");
        return;
    }
    adc1_fast_rank2_channel = adcChannelEnumToNumber(sConfig.Channel);

#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_CH_SET,rank=2,channel=3\r\n");
#endif

    /* Configure Channel 4 (V_cap+) - Rank 3 */
    sConfig.Channel = ADC_CHANNEL_4;  // PA3 = AMC1311B CAP OUTP
    sConfig.Rank = ADC_REGULAR_RANK_3;
    sConfig.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        uartSend("DENY,CH4_CFG_FAIL\r\n");
        return;
    }

#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_CH_SET,rank=3,channel=4\r\n");
    uartSend("DBG,ADC_CFG,mode=register,scan=1,nbr=3,disc=0\r\n");
#endif

    adc1_fast_current_mode = true;
#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_FAST_MODE_OK\r\n");
#endif

    adcPrepareVcapNChannel(); /* Pre-configure ADC2 for fast V_cap- reads */
}

/* Fast-path weld current read using register-level ADC access. */
static bool adcReadFastCurrentPair(uint32_t* out_p, uint32_t* out_n) {
    if (!out_p || !out_n) {
        return false;
    }

    *out_p = 0U;
    *out_n = 0U;

    /* Verify fast mode is enabled */
    if (!adc1_fast_current_mode) {
        return false;
    }

    /* Ensure ADC is stopped first */
    if (hadc1.Instance->CR & ADC_CR_ADSTART) {
        hadc1.Instance->CR |= ADC_CR_ADSTP;
        uint32_t stop_timeout = 100000U;
        while (hadc1.Instance->CR & ADC_CR_ADSTP) {
            if (--stop_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADSTP_TIMEOUT");
#endif
                return false;
            }
        }
    }

    /* Ensure ADC is enabled and ready */
    if (!(hadc1.Instance->CR & ADC_CR_ADEN)) {
        hadc1.Instance->CR |= ADC_CR_ADEN;
        uint32_t ready_timeout = 100000U;
        while (!(hadc1.Instance->ISR & ADC_ISR_ADRDY)) {
            if (--ready_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADRDY_TIMEOUT");
#endif
                return false;
            }
        }
    }

    /* Clear stale conversion flags before starting */
    hadc1.Instance->ISR = ADC_ISR_EOC | ADC_ISR_EOS;

    /* Start conversion */
    hadc1.Instance->CR |= ADC_CR_ADSTART;

    /* Wait for Rank 1 EOC */
    uint32_t timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
#if ADC_PAIR_VERBOSE_DEBUG
            uartSend("DBG,REG_POLL1_TIMEOUT");
#endif
            return false;
        }
    }

    /* Read Rank 1 value immediately */
    *out_p = hadc1.Instance->DR;

    /* Wait for Rank 2 EOC */
    timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
#if ADC_PAIR_VERBOSE_DEBUG
            char msg[60];
            snprintf(msg, sizeof(msg), "DBG,REG_POLL2_TIMEOUT,p=%u",
                     (unsigned int)(*out_p));
            uartSend(msg);
#endif
            return false;
        }
    }

    /* Read Rank 2 value immediately */
    *out_n = hadc1.Instance->DR;

    /* Stop ADC and wait for stop complete */
    hadc1.Instance->CR |= ADC_CR_ADSTP;
    timeout = 100000U;
    while (hadc1.Instance->CR & ADC_CR_ADSTP) {
        if (--timeout == 0U) {
            /* Stop timeout is non-fatal here */
            break;
        }
    }

#if ADC_PAIR_VERBOSE_DEBUG
    {
        char msg[80];
        snprintf(msg, sizeof(msg), "DBG,ADC_PAIR,ok,p=%u,n=%u",
                 (unsigned int)(*out_p), (unsigned int)(*out_n));
        uartSend(msg);
    }
#endif

    return true;
}

static uint32_t adcReadFastVcapN(void) {
    if (hadc2.Instance->CR & ADC_CR_ADSTART) {
        hadc2.Instance->CR |= ADC_CR_ADSTP;
        uint32_t t = 10000U;
        while (hadc2.Instance->CR & ADC_CR_ADSTP) {
            if (--t == 0U) return 0U;
        }
    }
    hadc2.Instance->ISR = ADC_ISR_EOC | ADC_ISR_EOS;
    hadc2.Instance->CR |= ADC_CR_ADSTART;
    uint32_t t = 100000U;
    while (!(hadc2.Instance->ISR & ADC_ISR_EOC)) {
        if (--t == 0U) return 0U;
    }
    return hadc2.Instance->DR;
}

/* Fast-path weld current + Vcap+ read using register-level ADC access. */
static bool adcReadFastTriplet(uint32_t* out_p, uint32_t* out_n,
                               uint32_t* out_vp) {
    if (!out_p || !out_n || !out_vp) {
        return false;
    }

    *out_p = 0U;
    *out_n = 0U;
    *out_vp = 0U;

    if (!adc1_fast_current_mode) {
        return false;
    }

    if (hadc1.Instance->CR & ADC_CR_ADSTART) {
        hadc1.Instance->CR |= ADC_CR_ADSTP;
        uint32_t stop_timeout = 100000U;
        while (hadc1.Instance->CR & ADC_CR_ADSTP) {
            if (--stop_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADSTP_TIMEOUT");
#endif
                return false;
            }
        }
    }

