farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /*
     * Off-by-one fix: counter counts 0 → ARR inclusive = ARR+1 ticks.
     * For exactly N µs at 1 MHz we need ARR = N − 1.
     * UIE is NOT armed here — gap delays have no FET to kill.
     */
    TIM2->CNT = 0;
    TIM2->ARR = delay_us - 1U;
    TIM2->DIER = 0U; /* no interrupt for gaps */
    TIM2->SR = 0;
    TIM2->CR1 = TIM_CR1_CEN | TIM_CR1_OPM;

    while (!(TIM2->SR & TIM_SR_UIF)) {
        /* spin — gap timing, no ADC sampling needed */
    }

    TIM2->CR1 = 0;
    TIM2->SR = 0;
}

static void start_weld_pulse_capture(void) {
    waveform_index = 0;
    waveform_pulse_start_index = 0;
    waveform_pulse_end_index = 0;
    waveform_preheat_start_index = 0;
    waveform_preheat_end_index = 0;
    waveform_gap_start_index = 0;
    waveform_gap_end_index = 0;
    waveform_main_start_index = 0;
    waveform_main_end_index = 0;
    waveform_capture_start_us = micros_now();
    waveform_last_sample_us = waveform_capture_start_us;
    waveform_capture_active = true;
#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,WAVEFORM_CAPTURE_START");
#endif
}

static bool waveform_push_sample(float current_amps, float voltage_volts,
                                 uint32_t timestamp_us) {
    uint16_t sample_idx = 0U;

    __disable_irq();
    if (!waveform_capture_active || waveform_index >= WAVEFORM_BUFFER_SIZE) {
        __enable_irq();
        return false;
    }

    sample_idx = waveform_index;
    waveform_index++;
    __enable_irq();

    waveform_buffer[sample_idx].current_amps = current_amps;
    waveform_buffer[sample_idx].voltage_volts = voltage_volts;
    waveform_buffer[sample_idx].timestamp_us = timestamp_us;
    return true;
}

static bool resolve_phase_start_from_waveform(uint16_t start_index,
                                              uint16_t end_index,
                                              uint32_t* out_abs_us) {
    if (out_abs_us == NULL) {
        return false;
    }

    if (end_index > waveform_index) {
        end_index = waveform_index;
    }
    if (start_index >= end_index) {
        return false;
    }

    float phase_peak_amps = 0.0f;
    for (uint16_t i = start_index; i < end_index; i++) {
        float amps = waveform_buffer[i].current_amps;
        if (isfinite(amps) && amps > phase_peak_amps) {
            phase_peak_amps = amps;
        }
    }
    if (phase_peak_amps <= 0.0f) {
        return false;
    }

    float threshold_amps = phase_peak_amps * PHASE_START_PEAK_RATIO;
    if (threshold_amps < PHASE_START_MIN_CURRENT_A) {
        threshold_amps = PHASE_START_MIN_CURRENT_A;
    }

    for (uint16_t i = start_index; i < end_index; i++) {
        float amps = waveform_buffer[i].current_amps;
        if (!isfinite(amps)) {
            continue;
        }
        if (amps >= threshold_amps) {
            *out_abs_us =
                waveform_capture_start_us + waveform_buffer[i].timestamp_us;
            return true;
        }
    }

    return false;
}

static bool resolve_phase_end_from_waveform(uint16_t start_index,
                                            uint16_t end_index,
                                            uint32_t* out_abs_us) {
    if (out_abs_us == NULL) {
        return false;
    }

    if (end_index > waveform_index) {
        end_index = waveform_index;
    }
    if (start_index >= end_index) {
        return false;
    }

    float phase_peak_amps = 0.0f;
    for (uint16_t i = start_index; i < end_index; i++) {
        float amps = waveform_buffer[i].current_amps;
        if (isfinite(amps) && amps > phase_peak_amps) {
            phase_peak_amps = amps;
        }
    }
    if (phase_peak_amps <= 0.0f) {
        return false;
    }

    float threshold_amps = phase_peak_amps * PHASE_START_PEAK_RATIO;
    if (threshold_amps < PHASE_START_MIN_CURRENT_A) {
        threshold_amps = PHASE_START_MIN_CURRENT_A;
    }

    for (uint16_t i = end_index; i > start_index; i--) {
        uint16_t idx = (uint16_t)(i - 1U);
        float amps = waveform_buffer[idx].current_amps;
        if (!isfinite(amps)) {
            continue;
        }
        if (amps >= threshold_amps) {
            *out_abs_us =
                waveform_capture_start_us + waveform_buffer[idx].timestamp_us;
            return true;
        }
    }

    return false;
}

static void capture_waveform_samples(uint16_t sample_count) {
    if (!waveform_capture_active || sample_count == 0U) {
        return;
    }

    const float v_per_count = measured_vdda / 4095.0f;
    uint32_t next_sample_us =
        waveform_last_sample_us + WAVEFORM_SAMPLE_INTERVAL_US;

    for (uint16_t captured = 0; captured < sample_count;) {
        if (waveform_index >= WAVEFORM_BUFFER_SIZE) {
            break;
        }

        uint32_t now_us = micros_now();
        if ((int32_t)(now_us - next_sample_us) < 0) {
            continue;
        }

        uint32_t p = 0U;
        uint32_t n = 0U;
        bool adc_ok = adcReadFastCurrentPair(&p, &n);
        uint32_t sample_time_us = micros_now();

        /* Never gate loop progress on ADC success. Use zeros when read fails.
         */
        if (!adc_ok) {
            p = 0U;
            n = 0U;
        }

        int32_t diff = (int32_t)p - (int32_t)n;
        if (diff < 0) {
            diff = 0;
        }

        float v_adc = (float)diff * v_per_count;
        float v_shunt = v_adc / SHUNT_GAIN;
        float amps = (v_shunt / SHUNT_EFF_OHMS) * CURRENT_CAL_FACTOR;
        if (!isfinite(amps) || amps < 0.0f) {
            amps = 0.0f;
        }

        waveform_push_sample(
            amps, cached_vcap,
            (uint32_t)(sample_time_us - waveform_capture_start_us));

        captured++;
        waveform_last_sample_us = sample_time_us;
        next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;

        now_us = micros_now();
        while ((int32_t)(now_us - next_sample_us) >= 0) {
            next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;
        }
    }

#if ADC_PAIR_VERBOSE_DEBUG
    /* Report first and last sample current values for ADC debug. */
    if (waveform_index > 0U) {
        char wf_debug[120];
        snprintf(wf_debug, sizeof(wf_debug),
                 "DBG,WAVEFORM_RAW,samples=%u,first_i=%.2f,last_i=%.2f",
                 (unsigned int)waveform_index, waveform_buffer[0].current_amps,
                 waveform_buffer[waveform_index - 1U].current_amps);
        uartSend(wf_debug);
    }
#endif
}

static uint16_t capture_waveform_until_deadline(uint32_t deadline_us) {
    if (!waveform_capture_active) {
        return 0U;
    }

    const float v_per_count = measured_vdda / 4095.0f;
    uint16_t captured = 0U;
    uint32_t next_sample_us =
        waveform_last_sample_us + WAVEFORM_SAMPLE_INTERVAL_US;

    while ((int32_t)(micros_now() - deadline_us) < 0) {
        if (waveform_index >= WAVEFORM_BUFFER_SIZE) {
            break;
        }

        uint32_t now_us = micros_now();
        if ((int32_t)(now_us - next_sample_us) < 0) {
            continue;
        }

        uint32_t p = 0U;
        uint32_t n = 0U;
        bool adc_ok = adcReadFastCurrentPair(&p, &n);
        uint32_t sample_time_us = micros_now();
        if (!adc_ok) {
            p = 0U;
            n = 0U;
        }

