farmertan81/Spot-Welder/STM32G474CE/src/main.c
    if (ms > MAX_WELD_MS) {
        ms = MAX_WELD_MS;
    }

    pwmOff();

    /*
     * Legacy helper retained for compatibility with existing call sites.
     * Gap timing now uses TIM2 one-shot for deterministic delay, matching
     * the hardware-timed pulse duration path.
     */
    tim2_delay_us((uint32_t)ms * 1000U);
}

static void fireRecipe(void) {
    uint32_t now_ms = HAL_GetTick();

    if (now_ms - boot_ms < BOOT_INHIBIT_MS) {
        char buf[64];
        snprintf(buf, sizeof(buf), "DENY,BOOT_INHIBIT,ms=%lu",
                 (unsigned long)(BOOT_INHIBIT_MS - (now_ms - boot_ms)));
        uartSend(buf);
        return;
    }

    applyArmTimeout();
    applyReadyTimeout();

    if (!system_ready) {
        uartSend("DENY,NOT_READY");
        return;
    }

    if (!armed) {
        uartSend("DENY,NOT_ARMED");
        return;
    }

    if (temp_filtered_c > 65.0f) {
        uartSend("DENY,OVERHEAT");
        return;
    }

    {
        bool need_contact = true;
        if (trigger_mode == 1 && contact_with_pedal == 0) {
            need_contact = false;  // pedal mode with contact check disabled
        }
        if (need_contact && !contactDetected()) {
            uartSend("DENY,NO_CONTACT");
            return;
        }
    }

    if (welding_now) {
        uartSend("DENY,ALREADY_WELDING");
        return;
    }

    uint32_t since = now_ms - last_weld_ms;
    if (since < WELD_COOLDOWN_MS) {
        char buf[64];
        snprintf(buf, sizeof(buf), "DENY,COOLDOWN,ms=%lu",
                 (unsigned long)(WELD_COOLDOWN_MS - since));
        uartSend(buf);
        return;
    }

    clampParams();

    if (control_mode == 1U) {
        char buf[96];
        snprintf(buf, sizeof(buf), "DBG,JOULE_MODE_ACTIVE,target=%.1f",
                 joule_target_j);
        uartSend(buf);
    }

    const uint16_t planned_pulse_ms = get_planned_active_pulse_ms();
    uint32_t planned_active_samples =
        ((uint32_t)planned_pulse_ms * 1000U) / WAVEFORM_SAMPLE_INTERVAL_US;
    uint32_t planned_total_samples = (uint32_t)WAVEFORM_PRE_SAMPLES +
                                     planned_active_samples +
                                     (uint32_t)WAVEFORM_POST_SAMPLES;
    if (planned_total_samples > WAVEFORM_BUFFER_SIZE) {
        planned_total_samples = WAVEFORM_BUFFER_SIZE;
    }

    /* === WELD SEQUENCE (modified per refactor plan) === */

    /* Step 1: Disable charger */
    HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
    charger_enabled = false;

    /* Step 2: Wait 50ms for charger to settle */
    HAL_Delay(50);

    welding_now = true;
    current_peak_amps = 0.0f;

    /* Reset Joule runtime tracking at weld start. */
    joule_accumulated = 0.0f;
    joule_total_accumulated = 0.0f;
    joule_lead_loss_accumulated = 0.0f;
    joule_target_reached = false;
    joule_timeout_abort = false;
    joule_bad_contact_abort = false;
    joule_actual_duration_us = 0U;

    /* Step 3: ADC diagnostic snapshot BEFORE weld (diagnostic only) */
    cal_vcap_before = readCapVoltage();
    cached_vcap = cal_vcap_before;

    /* Pre-configure fast current channels once before entering pulse loops.
     * This removes HAL_ADC_ConfigChannel jitter from the hot path.
     * Ensure ADC1 is fully idle before fast-mode reconfiguration. */
    HAL_ADC_Stop(&hadc1);
    adc1_fast_current_mode = false;

    adcPrepareFastCurrentChannels();

    /* Verify fast mode configured successfully */
    if (!adc1_fast_current_mode) {
        welding_now = false;
        uartSend("DENY,ADC_FAST_CFG_FAIL");
        return;
    }
#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_FAST_MODE_OK\r\n");
#endif

    /* Warmup loop - ADC needs time to stabilize after reconfiguration.
     * We only need to verify conversions complete successfully. */
    uint32_t p_warmup = 0U;
    uint32_t n_warmup = 0U;
    bool warmup_ok = false;

    for (int warmup_tries = 0; warmup_tries < 10; warmup_tries++) {
        if (adcReadFastCurrentPair(&p_warmup, &n_warmup)) {
            warmup_ok = true;

#if ADC_PAIR_VERBOSE_DEBUG
            char warmup_msg[100];
            snprintf(warmup_msg, sizeof(warmup_msg),
                     "DBG,ADC_WARMUP_OK,tries=%d,p=%lu,n=%lu", warmup_tries + 1,
                     (unsigned long)p_warmup, (unsigned long)n_warmup);
            uartSend(warmup_msg);
#endif
            break;
        }
        /* Can enable this if additional settle time is needed. */
        // HAL_Delay(1);
    }

    if (!warmup_ok) {
        welding_now = false;
        uartSend("DENY,ADC_WARMUP_FAIL");
        return;
    }

#if ADC_PAIR_VERBOSE_DEBUG
    char adc_debug[120];
    snprintf(adc_debug, sizeof(adc_debug),
             "DBG,ADC_PRE_WELD,ok=%d,p_raw=%lu,n_raw=%lu,diff=%ld",
             warmup_ok ? 1 : 0, (unsigned long)p_warmup,
             (unsigned long)n_warmup,
             (long)((int32_t)p_warmup - (int32_t)n_warmup));
    uartSend(adc_debug);
#endif

    uartSend("EVENT,WELD_START");

    pwmOff();
    HAL_Delay(2);

    /* Start capture before pulse so waveform includes 1ms pre-buffer baseline
     * before MOSFET firing (samples 0-9).
     *
     * TIM2 ISR (priority 0) kills FET with ~70 ns latency.
     * Interrupts MUST remain enabled so TIM2_IRQHandler can fire.
     * ADC sampling jitter from other ISRs (5-20 µs) is acceptable —
     * what matters is the FET-off timing, which is hardware-guaranteed.
     */

    start_weld_pulse_capture();
    capture_waveform_samples((uint16_t)WAVEFORM_PRE_SAMPLES);

    /* Pulse window metadata reported to host/UI must refer to MAIN weld pulse
     * only (not preheat and not preheat gap). Initialize to current index and
     * update when main pulse starts. */
    waveform_pulse_start_index = waveform_index;
    waveform_pulse_end_index = waveform_index;

    /* Phase markers for WAVEFORM_START. */
    waveform_preheat_start_index = 0U;
    waveform_preheat_end_index = 0U;
    waveform_gap_start_index = 0U;
    waveform_gap_end_index = 0U;
    waveform_main_start_index = waveform_index;
    waveform_main_end_index = waveform_index;

    wf_preheat_start_us = 0U;
    wf_preheat_end_us = 0U;
    wf_gap_start_us = 0U;
    wf_gap_end_us = 0U;
    wf_main_start_us = 0U;
    wf_main_end_us = 0U;

    /* Track ACTUAL captured main pulse end index (exclusive) for avg_a and
     * energy windowing. */
    uint16_t actual_pulse_end_index = waveform_pulse_start_index;
    bool main_pulse_started = false;
    uint32_t main_pulse_elapsed_us = 0U;

    /* Measure weld duration with microsecond precision to avoid +1ms skew from
     * HAL tick quantization while preserving waveform alignment. */
    uint32_t weld_start_us = micros_now();

