farmertan81/Spot-Welder/STM32G474CE/src/main.c
    welding_now = true;
    cached_vcap = v_before;

    HAL_ADC_Stop(&hadc1);
    adc1_fast_current_mode = false;
    adcPrepareFastCurrentChannels();
    if (!adc1_fast_current_mode) {
        welding_now = false;
        uartSend("CAL_ERROR=ADC_FAST_CFG_FAIL");
        return;
    }

    /* ---- Fire the test pulse with the TIM2 hardware FET-kill safety net ----
     * Mirrors doPulseMsPwm(): arm TIM2 one-pulse, start it, then FET ON. The
     * TIM2 ISR force-kills the FET at expiry regardless of this loop. */
    const uint32_t duration_us = (uint32_t)CAL_PULSE_MS * 1000U;
    const float v_per_count = measured_vdda / 4095.0f;

    double sum_i = 0.0;
    double sum_v = 0.0;
    uint32_t n = 0U;

    tim2_fet_killed = false;
    TIM2->CR1 = 0U;
    TIM2->CNT = 0U;
    TIM2->ARR = (duration_us > 0U) ? (duration_us - 1U) : 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;

    TIM2->CR1 = TIM_CR1_CEN | TIM_CR1_OPM; /* GO */
    pwmOnDuty(PWM_MAX);                    /* FET ON, 100 % duty */

    uint32_t sample_start_us = micros_now() + CAL_SETTLE_US;

    while (!tim2_fet_killed) {
        uint32_t p = 0U, nn = 0U, v_p = 0U;
        if (!adcReadFastTriplet(&p, &nn, &v_p)) {
            continue;
        }
        /* Skip the initial settle window so we measure steady-state values. */
        if ((int32_t)(micros_now() - sample_start_us) < 0) {
            continue;
        }

        int32_t diff = (int32_t)p - (int32_t)nn;
        if (diff < 0) diff = 0;

        float v_adc = (float)diff * v_per_count;
        float v_shunt = v_adc / SHUNT_GAIN;
        float amps = (v_shunt / SHUNT_EFF_OHMS) * CURRENT_CAL_FACTOR;
        if (!isfinite(amps) || amps < 0.0f) amps = 0.0f;

        /* adc2_fast_vcap_mode is not enabled on this path (matches weld path),
         * so the negative leg is treated as 0 just like capturePulseAmps. */
        float v_cap = (float)v_p * v_per_count * V_CAP_DIVIDER;
        if (!isfinite(v_cap) || v_cap < 0.0f) v_cap = 0.0f;

        sum_i += (double)amps;
        sum_v += (double)v_cap;
        n++;
    }

    pwmOff(); /* belt-and-suspenders; ISR already killed the FET */
    welding_now = false;
    last_weld_ms = HAL_GetTick();

    /* Re-engage charger lockout briefly, like the weld path does. */
    __disable_irq();
    charger_lockout = true;
    charger_lockout_until = HAL_GetTick() + 500;
    __enable_irq();

    /* A slow read here also auto-restores ADC1 out of fast-current mode. */
    HAL_Delay(5);
    float v_after = readCapVoltage();

    if (n == 0U) {
        uartSend("CAL_ERROR=NO_SAMPLES");
        return;
    }

    float i_avg = (float)(sum_i / (double)n);
    float v_avg = (float)(sum_v / (double)n);

    /* Not enough current => tips were not actually shorted. */
    if (i_avg < CAL_MIN_CURRENT_A) {
        char eb[80];
        snprintf(eb, sizeof(eb), "CAL_ERROR=TIPS_NOT_SHORTED,i=%.1f", i_avg);
        uartSend(eb);
        return;
    }

    float r = v_avg / i_avg;
    if (!isfinite(r) || r < CAL_R_MIN_OHMS || r > CAL_R_MAX_OHMS) {
        char eb[96];
        snprintf(eb, sizeof(eb),
                 "CAL_ERROR=MEASUREMENT_FAILED,r=%.6f,v=%.3f,i=%.1f", r, v_avg,
                 i_avg);
        uartSend(eb);
        return;
    }

    /* ---- Persist using the exact same path as the SET_LEAD_R handler ---- */
    lead_resistance_ohms = r;
    persistent_from_runtime(&g_persistent_settings);
    bool saved = flash_settings_save(&g_persistent_settings);

    /* Terminal success line (resistance in Ohms, parsed as bare float). */
    char ok[48];
    snprintf(ok, sizeof(ok), "CAL_RESULT=%.6f", r);
    uartSend(ok);

    /* Diagnostic line (DBG prefix -> ignored by the calibration parser). */
    char dbg[192];
    snprintf(dbg, sizeof(dbg),
             "DBG,CAL,r_ohm=%.6f,r_mohm=%.3f,v_avg=%.3f,i_avg=%.1f,"
             "v_before=%.3f,v_after=%.3f,samples=%lu,saved=%d",
             r, r * 1000.0f, v_avg, i_avg, v_before, v_after,
             (unsigned long)n, saved ? 1 : 0);
    uartSend(dbg);

    if (!saved) {
        /* Value applied to runtime but Flash write failed; report non-fatally
         * so the host still gets the measurement but knows it is not stored. */
        uartSend("DBG,CAL,FLASH_SAVE_FAILED");
    }

    sendStatusPacket(); /* immediate UI refresh with the new lead-R */
}

static void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;

    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV4;
    RCC_OscInitStruct.PLL.PLLN = 85;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
    RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        while (1) {
        }
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK) {
        while (1) {
        }
    }
}

static void MX_GPIO_Init(void) {
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};

    GPIO_InitStruct.Pin = LED_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = PEDAL_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(PEDAL_PORT, &GPIO_InitStruct);

