farmertan81/Spot-Welder/STM32G474CE/src/main.c
    uint32_t sumP = 0, sumN = 0;
    const int samples = 16;
    int valid = 0;

    for (int i = 0; i < samples; i++) {
        uint32_t p = adcReadChannel(ADC_CHANNEL_4);    // PA3
        uint32_t n = adcReadChannel2(ADC_CHANNEL_17);  // PA4

        if (p == 0xFFFF || n == 0xFFFF) continue;

        sumP += p;
        sumN += n;
        valid++;
    }

    if (valid == 0) return 0.0f;

    float vdda = measured_vdda;

    float vP = ((float)sumP / valid) * (vdda / 4095.0f);
    float vN = ((float)sumN / valid) * (vdda / 4095.0f);

    float v = (vP - vN) * V_CAP_DIVIDER;

    /* Clamp negative noise to zero (AMC1311B outputs ~0 differential at idle
     * with no return path – this is correct hardware behavior, not a bug).
     * Upper clamp removed: allow readings above 9.5V for accurate delta_v
     * capture during high-charge welds. */
    if (v < 0.0f) v = 0.0f;

    return v;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef* huart) {
    if (huart->Instance == USART1) {
        char c = (char)rx_byte;
        uart_rx_bytes++;

        if (c == '\n' || c == '\r') {
            if (rx_idx > 0) {
                rx_build[rx_idx] = '\0';
                if (!rx_line_ready) {
                    memcpy(rx_ready, rx_build, rx_idx + 1);
                    rx_line_ready = true;
                }
                rx_idx = 0;
            }
        } else if (rx_idx < RX_LINE_MAX - 1) {
            rx_build[rx_idx++] = c;
        } else {
            rx_idx = 0;
        }

        HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
    }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef* huart) {
    if (huart->Instance == USART1) {
        uint32_t err = huart->ErrorCode;
        uart_rx_errors++;

        if (err & HAL_UART_ERROR_ORE) uart_rx_overruns++;

        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_FEF);
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_NEF);
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_PEF);
        huart->ErrorCode = HAL_UART_ERROR_NONE;

        HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
    }
}

static void parseCommand(char* line) {
    char response[256];

    /* Sanitise the incoming line BEFORE any strcmp(). The RX ISR normally
     * splits on \r/\n, but be defensive: skip leading whitespace (and actually
     * advance 'line' past it), then trim any trailing \r, \n or spaces. This
     * guarantees "BOOTLOADER\r\n" (or " BOOTLOADER ") becomes exactly
     * "BOOTLOADER" so the comparisons below match. */
    {
        char* p = line;
        while (*p == ' ' || *p == '\t') p++;  /* skip leading whitespace */
        line = p;

        size_t len = strlen(line);
        while (len > 0 &&
               (line[len - 1] == '\r' || line[len - 1] == '\n' ||
                line[len - 1] == ' ' || line[len - 1] == '\t')) {
            line[--len] = '\0';
        }

        if (len == 0) return;  /* nothing left after trimming */
    }

    /* Remote firmware update: re-enter the factory ROM bootloader so the ESP32
     * can flash a new image over UART (AN3155).
     *
     * HARDWARE BOOT0 ENTRY (rock-solid, ST-supported):
     * The ESP32 has a dedicated control wire from its GPIO38 to the STM32 BOOT0
     * pin (PB8). Before sending this command the ESP32 drives BOOT0 HIGH and
     * holds it for the whole flash. All we do here is ACK and issue a clean
     * NVIC_SystemReset(). On the ensuing reset the chip samples BOOT0=1 and
     * starts the factory ROM bootloader exactly as it would on a hardware reset
     * with BOOT0 asserted - fully USART-responsive on PA9/PA10 at 8E1. The ESP32
     * drops BOOT0 LOW again after flashing so the next reset boots the app.
     * Accept both the bare and CMD-prefixed command forms. */
    if (strcmp(line, "BOOTLOADER") == 0 || strcmp(line, "CMD,BOOTLOADER") == 0) {
        /* SOFTWARE (BOOT0-independent) ROM-bootloader entry.
         * Earlier this did a bare NVIC_SystemReset() and relied entirely on the
         * ESP32 holding the hardware BOOT0 pin high. Field testing proved that
         * strap is NOT effective on this board (after the reset the chip lands
         * back in the application, broadcasting STATUS at 1 Mbaud, instead of
         * the silent ROM bootloader) - whether due to the GPIO31->BOOT0 wiring
         * or an option byte (nBOOT_SEL) that makes BOOT0 ignored.
         *
         * requestBootloaderReset() instead stashes BOOTLOADER_REQUEST_MAGIC in a
         * TAMP backup register and resets. The magic survives the warm reset and
         * is detected at the very top of main() (before the IWDG is re-armed),
         * which then calls jumpToBootloader() to remap system memory and jump to
         * the ROM at 0x1FFF0000. This reaches the ROM bootloader with NO reliance
         * on the BOOT0 pin at all. */
        uartSend("DBG,BOOTLOADER command received -> requesting KATAPULT bootloader "
                 "entry (2-wire flash on USART1 PA9/PA10, no BOOT0/NRST needed)");
        HAL_Delay(20);
        uartSend("ACK,BOOTLOADER");
        HAL_Delay(50);              /* ensure the ACK is fully transmitted */
        requestKatapultReset();     /* sets Katapult request signature + reset; no return */
        return;                     /* unreachable */
    }

    if (strncmp(line, "READY,", 6) == 0) {
        int v = atoi(line + 6);
        if (v == 1) {
            system_ready = true;
            ready_until_ms = HAL_GetTick() + READY_TIMEOUT_MS;
            uartSend("ACK,READY,1");
        } else {
            system_ready = false;
            ready_until_ms = 0;
            uartSend("ACK,READY,0");
        }
        return;
    }

    if (strncmp(line, "ARM,", 4) == 0) {
        int v = atoi(line + 4);
        if (v == 1) {
            armed = true;
            armed_until_ms =
                (ARM_TIMEOUT_MS == 0) ? 0 : (HAL_GetTick() + ARM_TIMEOUT_MS);
            uartSend("ACK,ARM,1");
        } else {
            armed = false;
            armed_until_ms = 0;
            uartSend("ACK,ARM,0");
        }
        return;
    }

