farmertan81/Spot-Welder/STM32G474CE/src/main.c
/* Boot-time snapshot of the TAMP backup register, captured before it is
 * cleared. Emitted over UART once the UART is initialised so the host can see
 * exactly what value survived the reset on a normal (no-magic) boot. */
static uint32_t g_boot_tamp_value = 0;

int main(void) {
    /* KATAPULT BOOTLOADER RELOCATION: this application is linked to start at
     * 0x08002000 (the first 8 KiB of flash holds the Katapult bootloader).
     * Re-assert the vector table offset here so all interrupt vectors resolve
     * to the application's table, regardless of how we were entered. Katapult
     * already sets VTOR before jumping, but doing it again is harmless and makes
     * the app robust even if launched by other means. Must run before any IRQ
     * is enabled (HAL_Init() below configures SysTick). */
    SCB->VTOR = 0x08002000U;
    __DSB();

    /* Disable the UCPD "dead battery" pull-down behavior at the very start.
     * After reset the STM32G4 enables ~5.1k Rd pull-downs on the UCPD1_CC1 and
     * UCPD1_CC2 pins (PB6 and PB4 on this package - see RM0440 Table, PWR_CR3
     * bit 14). We do not use USB Type-C / Power Delivery, and PB4/PB6 are GPIO,
     * so clear those pull-downs once the application runs. NOTE: this does NOT
     * affect USART1_RX (PA10) and does NOT change ROM-bootloader behavior - the
     * bootloader runs from a fresh reset where this bit is re-enabled anyway. */
    RCC->APB1ENR1 |= RCC_APB1ENR1_PWREN;   /* enable PWR peripheral clock   */
    PWR->CR3 |= PWR_CR3_UCPD_DBDIS;        /* remove UCPD CC dead-battery Rd */

    HAL_Init();

    /* Software bootloader entry: if the "BOOTLOADER" UART command requested an
     * update, requestBootloaderReset() stored a magic marker and reset the MCU
     * (which also stopped the IWDG). Detect that here - BEFORE the clocks/
     * peripherals are configured and BEFORE MX_IWDG_Init() re-arms the watchdog -
     * clear the marker, and jump straight into the ROM bootloader.
     *
     * PRIMARY check: the .noinit SRAM marker, which survives a warm reset on this
     * board. FALLBACK check: the TAMP backup register (only valid if VBAT wired).
     * Either one being set triggers the jump. */
    bootloaderEnableBackupAccess();
    g_boot_tamp_value = BOOTLOADER_FLAG_REG;   /* snapshot for later logging */
    bool bl_req = (g_bootloader_marker == BOOTLOADER_REQUEST_MAGIC) ||
                  (g_boot_tamp_value == BOOTLOADER_REQUEST_MAGIC);
    if (bl_req) {
        g_bl_stage = BLSTAGE(2);   /* breadcrumb: marker seen, about to jump */
        g_bootloader_marker = 0;   /* one-shot: clear SRAM marker  */
        BOOTLOADER_FLAG_REG = 0;   /* one-shot: clear TAMP fallback */
        __DSB();
        /* RESTORED to the PROVEN 6cebf05 path: jump straight into the ROM
         * bootloader IMMEDIATELY, with the clock still at its HSI 16 MHz reset
         * default and no peripherals configured. The earlier "bring up clock +
         * UART to print debug, then tear it all down" sequence (and the SYSCFG
         * MEMRMP remap inside jumpToBootloader) was added during failed
         * debugging and is NOT what worked on the old board — it left the ROM
         * bootloader unresponsive on USART1. The pre-reset debug emitted by
         * requestBootloaderReset() already proves this path is taken; we do not
         * need post-reset debug here, and adding it changed the very behavior
         * we are trying to restore. jumpToBootloader() does HAL_RCC_DeInit() so
         * the ROM still starts from a clean HSI state and sets up its own
         * 72 MHz PLL per AN2606 Figure 58. */
        jumpToBootloader();        /* does not return */
    }

    SystemClock_Config();
    SystemCoreClockUpdate();
    HAL_InitTick(TICK_INT_PRIORITY);

    /* Enable DWT cycle counter for microsecond timestamps used by waveform
     * capture. */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    MX_GPIO_Init();

    /* 100ms delay for INA226 power rail stabilization */
    HAL_Delay(100);

    for (int i = 0; i < 3; i++) {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(80);
    }

    /* I2C bus recovery before initialization – unstick any hung devices */
    i2c_bus_recovery();

    MX_I2C1_Init(); /* I2C1 for INA226 sensors – graceful, no hang */
    MX_USART1_UART_Init();

    /* Bootloader-request diagnostic. The PRIMARY mechanism is now the .noinit
     * SRAM marker (g_bootloader_marker); the TAMP register is only a fallback for
     * boards with VBAT wired (it reads 0x00000000 on this WeAct board, which is
     * EXPECTED and fine - the SRAM marker carries the request instead). On a
     * normal boot neither is set and we land here. This single line is only
     * emitted if something looks off, so a clean boot is quiet. */
    if (g_boot_tamp_value != 0) {
        char dbg[72];
        snprintf(dbg, sizeof(dbg),
                 "DBG,Boot: unexpected TAMP=0x%08lX (early jump skipped?)",
                 (unsigned long)g_boot_tamp_value);
        uartSend(dbg);
    }

    /* Print the software-bootloader breadcrumb if one was stamped on the prior
     * (pre-reset) run. .noinit survives the warm/NRST reset, so this reveals how
     * far the last software ROM-entry attempt actually got:
     *   3 = reached the ROM jump (failure, if any, is on the ROM/USART side)
     *   2 = early-main saw the marker but jumpToBootloader() faulted before branch
     *   1 = reset happened but the marker was lost across it (early jump skipped)
     * Cleared after printing so it only reports once per attempt. */
    if ((g_bl_stage & 0xFFFFFF00UL) == BLSTAGE_MAGIC) {
        char dbg[80];
        snprintf(dbg, sizeof(dbg),
                 "DBG,BL breadcrumb: last software ROM-entry reached stage %lu/3",
                 (unsigned long)(g_bl_stage & 0xFFUL));
        uartSend(dbg);
        g_bl_stage = 0;
    }

    persistent_defaults(&g_persistent_settings);
    flash_settings_init();
    bool load_ok = flash_settings_load(&g_persistent_settings);
    if (load_ok) {
        apply_loaded_settings(&g_persistent_settings);
    } else {
        persistent_defaults(&g_persistent_settings);
        apply_loaded_settings(&g_persistent_settings);
        uartSend("INFO,no saved settings yet, using defaults");
    }

    // Boot override: always start disarmed + pedal trigger, regardless of what
    // was in flash. Other persisted settings (contact_hold, lead_r, etc.) are
    // respected, but for safety the welder must boot in the safe state.
    armed = false;
    trigger_mode = 1;  // 1 = pedal, 2 = probe contact

    MX_ADC1_Init();
    OPAMP1->CSR &= ~OPAMP_CSR_OPAMPxEN;
    MX_ADC2_Init(); /* ADC2 for PA4 (AMC1311B OUTN = ADC2_IN17) */
    MX_TIM1_Init();
    init_tim2_1mhz();

